app/views/messages/_recipients.html.erb

SELECT "users".* FROM "users"
---
                        <br>
                        <%= check_box_tag "message[user_tokens][]", user.id, @message.users.include?(user), id: "user#{user.id}", name:"someSwitchOption001" ,class:'myCheckbox' %>