app/views/programs/_in.html.erb

          <div class="col-md-11" style="content: '\007C\00a0\00a0';align-content: center">
  <%@programs = Program.all  %>
---
SELECT "programs".* FROM "programs"