app/views/mdos/_form.html.erb

SELECT  "cards".* FROM "cards" WHERE "cards"."mdo_id" = $1 LIMIT $2  [["mdo_id", 1], ["LIMIT", 1]]
---

                $(document).ready(function(){

                  $("#cardinfo").hide();

                  $("input:radio[name='payment']").change(function(){

                    if(this.value == 'card' && this.checked){
                      <% @check_pay = "card" %>
                      $('html, body').animate({scrollTop:$('#cardinfo').position().top}, 'slow');
                      $("#cardinfo").show();
                      $("#donatewithpaypal").hide()
                    }else{
                      <% @check_pay = "paypal" %>
                      $("#cardinfo").hide();
                      $("#donatewithpaypal").show()
                    }

                  });

                });