app/controllers/mdos_controller.rb

SELECT COUNT(*) FROM "mdos"
SELECT "mdos".* FROM "mdos"
---
  def index
    @count = Mdo.count
    #@mdo = Mdo.all
    #@mdos = Mdo.all
    @mdos = Mdo.all

INSERT INTO "mdos" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-08-21 09:13:01 UTC], ["updated_at", 2017-08-21 09:13:01 UTC]]
---
  def create

    @mdo = Mdo.new(mdo_params)


      @mdo.card.ip_address = request.remote_ip until present?



    if @mdo.save