app/controllers/memberdetails_controller.rb

  def index
    #@memberdetails = Memberdetail.all
    @memberdetails = Memberdetail.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "memberdetails".* FROM "memberdetails" ORDER BY "memberdetails"."id" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "memberdetails"