app/controllers/messages_controller.rb

  def new
    @message = Message.new
    @recipients = User.all
---
SELECT "users".* FROM "users"