app/controllers/programs_controller.rb

SELECT  "programs".* FROM "programs" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @programs = Program.all
    @programs = Program.paginate(:page => params[:page], :per_page => 30)