app/controllers/regs_controller.rb

  def create
    @reg = Reg.new(reg_params)

    @reg.card.ip_address = request.remote_ip
    @reg.user_id = current_user.id
    if @reg.save
      user = User.find(current_user.id)
      role_name = @reg.member_role
      if user_signed_in?
        user.card_id = current_user.reg.card.id
        user.save
---
INSERT INTO "cards" ("reg_id", "ip_address", "first_name", "card_type", "card_expires_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "regs" ("member_role", "full_name", "company", "email", "telephone", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "regs" SET "purchased_at" = $1, "updated_at" = $2 WHERE "regs"."id" = $3  [["purchased_at", 2017-09-24 13:15:20 UTC], ["updated_at", 2017-09-24 13:15:20 UTC], ["id", 1]]
UPDATE "users" SET "card_id" = $1, "role_id" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["card_id", 2], ["role_id", 3], ["updated_at", 2017-09-24 13:09:00 UTC], ["id", 4]]

  def set_reg
    @reg = Reg.find(params[:id])
---
SELECT  "regs".* FROM "regs" WHERE "regs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]