app/controllers/usersinfo_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
SELECT COUNT(*) FROM "users" WHERE "users"."role_id" = $1  [["role_id", 1]]
---
  def userlist

    @current_uri = request.env['PATH_INFO']
    @users = User.order(:created_at).reverse_order

    @user_id = @@ban
    us1 = User.where(role_id: 1).count