app/controllers/userpersnaldets_controller.rb

  def index
    @userpersnaldets = Userpersnaldet.all
    if user_signed_in?
      @det = Userpersnaldet.all
      @dets = @det.find(current_user.id)
---
SELECT  "userpersnaldets".* FROM "userpersnaldets" WHERE "userpersnaldets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_userpersnaldet
      @userpersnaldet = Userpersnaldet.find(params[:id])
---
SELECT  "userpersnaldets".* FROM "userpersnaldets" WHERE "userpersnaldets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]